n = int(input("Укажите чему будет равно значение параметра n  -   "))
amount = (n + int(str(n) +str(n)) + int(str(n) + str(n) + str(n)))
print("Итого если значение расчитано как n+nn+nnn - %d" % amount)


